import { CustomList } from '../custom-list';
import { SectionWrapper } from '../section-wrapper';

const features = [
  'কোর্স শেষে কারিগরি বোর্ড কর্তৃক সার্টিফিকেট প্রদান।',
  'দূরের ছাত্রদের জন্য আবাসিক ব্যবস্থা।',
  'প্রতিষ্ঠানটি অত্যন্ত সুন্দর মনোরম পরিবেশে অবস্থিত।',
  'দুর্বল শিক্ষার্থীদের জন্য আলাদাভাবে পাঠদানের ব্যবস্থা।',
  'আধুনিক সরঞ্জামের মাধ্যমে আন্তর্জাতিক মানের শিক্ষক দ্বারা প্র্যাকটিক্যাল।',
  'চাকরিজীবীদের জন্য শুক্র ও শনিবার বিশেষ ক্লাস।',
  'ড্রাইভিং কোর্স শেষে লাইসেন্স প্রাপ্তিতে সার্বিক সহযোগিতা।',
  'প্রতিষ্ঠানটি সার্বক্ষণিক সিসি ক্যামেরা দ্বারা নিয়ন্ত্রিত।',
];

const services = [
  'অনলাইনে বিভিন্ন কলেজ বিশ্ববিদ্যালয়ে ভর্তির আবেদন।',
  'সকল প্রকার চাকরির আবেদন ও সিভি তৈরি।',
  'টিন সার্টিফিকেট বের করা হয়।',
  'ইন্ডিয়ান ভিসার আবেদন ও প্রসেসিং।',
  'পাসপোর্ট এর জন্য আবেদন ও প্রসেসিং।',
  'ড্রাইভিং লাইসেন্সের জন্য আবেদন ও প্রসেসিং।',
];

export function FeaturesAndServicesSection() {
  return (
    <SectionWrapper id="features">
      <div className="grid grid-cols-1 gap-8 md:grid-cols-2">
        <CustomList title="প্রতিষ্ঠানের বৈশিষ্ট্য সমূহ" items={features} />
        <div id="services">
          <CustomList title="আমাদের অনলাইন সেবা সমূহ" items={services} />
        </div>
      </div>
    </SectionWrapper>
  );
}
